dodb/docs/experiments/results/oci-a1-2ocpu-12g-zfs-planned-blink/fio-sync-after.txt
zfs-sync-4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 process
zfs-sync-4k: Laying out IO file (1 file / 256MiB)

zfs-sync-4k: (groupid=0, jobs=1): err= 0: pid=380273: Fri Sep 25 14:48:54 2026
  write: IOPS=1489, BW=5960KiB/s (6103kB/s)(87.3MiB/15001msec); 0 zone resets
    clat (usec): min=9, max=114, avg=16.92, stdev= 5.17
     lat (usec): min=9, max=114, avg=17.16, stdev= 5.23
    clat percentiles (nsec):
     |  1.00th=[11072],  5.00th=[12096], 10.00th=[12608], 20.00th=[13376],
     | 30.00th=[13888], 40.00th=[14528], 50.00th=[15040], 60.00th=[15936],
     | 70.00th=[17024], 80.00th=[20096], 90.00th=[24704], 95.00th=[27520],
     | 99.00th=[34048], 99.50th=[37120], 99.90th=[44800], 99.95th=[47872],
     | 99.99th=[67072]
   bw (  KiB/s): min= 4280, max= 6464, per=99.84%, avg=5950.90, stdev=618.66, samples=29
   iops        : min= 1070, max= 1616, avg=1487.72, stdev=154.67, samples=29
  lat (usec)   : 10=0.03%, 20=79.73%, 50=20.21%, 100=0.03%, 250=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=463, max=13377, avg=651.02, stdev=195.32
    sync percentiles (usec):
     |  1.00th=[  502],  5.00th=[  523], 10.00th=[  537], 20.00th=[  562],
     | 30.00th=[  586], 40.00th=[  603], 50.00th=[  619], 60.00th=[  635],
     | 70.00th=[  660], 80.00th=[  701], 90.00th=[  775], 95.00th=[  889],
     | 99.00th=[ 1205], 99.50th=[ 1336], 99.90th=[ 1893], 99.95th=[ 2835],
     | 99.99th=[ 7635]
  cpu          : usr=0.45%, sys=5.23%, ctx=22521, majf=0, minf=9
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22350,0,22350 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5960KiB/s (6103kB/s), 5960KiB/s-5960KiB/s (6103kB/s-6103kB/s), io=87.3MiB (91.5MB), run=15001-15001msec