dodb/docs/experiments/results/oci-a1-2ocpu-12g-zfs-planned-blink/fio-sync-before.txt
zfs-sync-4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 process
zfs-sync-4k: Laying out IO file (1 file / 256MiB)

zfs-sync-4k: (groupid=0, jobs=1): err= 0: pid=376721: Fri Sep 25 14:30:37 2026
  write: IOPS=1452, BW=5808KiB/s (5948kB/s)(85.1MiB/15001msec); 0 zone resets
    clat (nsec): min=9440, max=90644, avg=16611.10, stdev=5034.51
     lat (nsec): min=9680, max=91004, avg=16879.60, stdev=5085.95
    clat percentiles (nsec):
     |  1.00th=[11072],  5.00th=[11968], 10.00th=[12480], 20.00th=[13120],
     | 30.00th=[13760], 40.00th=[14272], 50.00th=[14912], 60.00th=[15680],
     | 70.00th=[16768], 80.00th=[19328], 90.00th=[24192], 95.00th=[27008],
     | 99.00th=[33536], 99.50th=[36608], 99.90th=[44800], 99.95th=[49408],
     | 99.99th=[66048]
   bw (  KiB/s): min= 3848, max= 6312, per=99.96%, avg=5806.34, stdev=590.36, samples=29
   iops        : min=  962, max= 1578, avg=1451.59, stdev=147.59, samples=29
  lat (usec)   : 10=0.08%, 20=81.17%, 50=18.70%, 100=0.05%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=472, max=12845, avg=668.78, stdev=202.50
    sync percentiles (usec):
     |  1.00th=[  506],  5.00th=[  529], 10.00th=[  553], 20.00th=[  578],
     | 30.00th=[  594], 40.00th=[  611], 50.00th=[  635], 60.00th=[  660],
     | 70.00th=[  685], 80.00th=[  725], 90.00th=[  799], 95.00th=[  922],
     | 99.00th=[ 1221], 99.50th=[ 1385], 99.90th=[ 2147], 99.95th=[ 3326],
     | 99.99th=[ 9241]
  cpu          : usr=0.65%, sys=4.82%, ctx=21815, majf=0, minf=9
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21782,0,21782 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5808KiB/s (5948kB/s), 5808KiB/s-5808KiB/s (5948kB/s-5948kB/s), io=85.1MiB (89.2MB), run=15001-15001msec